<div style="
    background-image: url('https://miro.medium.com/v2/resize:fit:1024/1*f74xr_c2PLl68XvLkokTLw.jpeg');
    background-size: cover;
    background-position: center;
    height: 380px;
    width: 100%;
    display: flex;
    align-items: center;
    padding-left: 20px;  
    color: white;
    border-radius: 10px;">
    
<span style="font-weight: bold; font-size: 30px;">ðŸŽ¯ 4. Pandas GiriÅŸ</span>

</div>

## 4.1 Pandas Nedir?
Pandas, veri analizi ve manipÃ¼lasyonu iÃ§in kullanÄ±lan bir Python kÃ¼tÃ¼phanesidir.

Temel veri yapÄ±larÄ±:

- **Series:** Tek boyutlu etiketli dizi.

- **DataFrame:** Ä°ki boyutlu etiketli veri yapÄ±sÄ± (tablo).

- Pandas, **CSV**, **Excel**, **SQL** gibi farklÄ± veri kaynaklarÄ±ndan **veri okuma ve yazma** desteÄŸi sunar.

Pandas, Python paket yÃ¶neticisi pip ile kurulabilir:

    pip install pandas

## 4.2 Temel Veri YapÄ±larÄ±

### 4.2.1 Series
**Series**, tek boyutlu etiketli bir dizidir.

Her eleman bir indeks (etiket) ile iliÅŸkilendirilir.

In [ ]:
import pandas as pd

# Series oluÅŸturma
data = pd.Series([10, 20, 30, 40])
print(data)
# 0    10
# 1    20
# 2    30
# 3    40
# dtype: int64

# Ã–zel indekslerle Series 
data = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(data)
# a    10
# b    20
# c    30
# d    40
# dtype: int64

Serinin dizi gÃ¶sterimini ve indeks nesnesini sÄ±rasÄ±yla **values** ve **index** Ã¶zellikleri aracÄ±lÄ±ÄŸÄ±yla alabilirsiniz:

In [ ]:
print(data.values)  # array([10, 20, 30, 40])

print(data.index)   # Index(['a', 'b', 'c', 'd'], dtype='object')

Tek bir deÄŸeri veya bir deÄŸer kÃ¼mesini seÃ§erken dizindeki etiketleri kullanabilirsiniz:

In [ ]:
print(data['a'])  # 10

print(data[['c', 'a', 'd']])  
# c    30 
# a    10 
# d    40

**NumPy** fonksiyonlarÄ±nÄ±n veya **NumPy** benzeri iÅŸlemlerin kullanÄ±lmasÄ±, Ã¶rneÄŸin **boolean** dizisi ile filtreleme, **skaler Ã§arpma** veya **matematik fonksiyonlarÄ±nÄ±n uygulanmasÄ±**, **index-value** baÄŸlantÄ±sÄ±nÄ± koruyacaktÄ±r:

In [ ]:
print((data > 0))  
# a     True
# b     True
# c     True
# d     True
# dtype: bool
print(data[data > 0])  
# a    10 
# b    20 
# c    30 
# d    40
print((data * 2))  
# a    20 
# b    40 
# c    60 
# d    80 
# dtype: int64

EÄŸer **sÃ¶zlÃ¼k** tÃ¼rÃ¼nde veriniz varsa ondan bir **seri** oluÅŸturabilirsiniz

In [ ]:
usa_data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
data = pd.Series(usa_data)
print(data)
# Ohio      35000
# Texas     71000
# Oregon    16000
# Utah       5000

YalnÄ±zca bir **sÃ¶zlÃ¼k yapÄ±sÄ±** ilettiÄŸinizde, sonuÃ§ta ortaya Ã§Ä±kan **Serideki indeks**, SÃ¶zlÃ¼k yapÄ±sÄ±nÄ±n **anahtarlarÄ±nÄ±** sÄ±ralÄ± olarak iÃ§erecektir. **SÃ¶zlÃ¼k anahtarlarÄ±nÄ±** ortaya Ã§Ä±kan Seri yapÄ±sÄ±nda gÃ¶rÃ¼nmelerini istediÄŸiniz sÄ±rada ileterek bunu geÃ§ersiz kÄ±labilirsiniz:

In [ ]:
states = ['California', 'Ohio', 'Texas', 'Oregon']
new_data = pd.Series(usa_data, index=states)
print(new_data)
# California        NaN
# Ohio          35000.0
# Texas         71000.0
# Oregon        16000.0
# dtype: float64

Burada, **states** listesinde bulunan Ã¼Ã§ deÄŸer uygun konumlara yerleÅŸtirildi, ancak **'California'** iÃ§in hiÃ§bir deÄŸer bulunamadÄ±ÄŸÄ±ndan, pandas'ta **eksik** veya **NA** deÄŸerlerini iÅŸaretlemek iÃ§in kullanÄ±lan **NaN (sayÄ± deÄŸil**) olarak gÃ¶rÃ¼nÃ¼r. **'Utah**' eyaletlere dahil edilmediÄŸinden, ortaya Ã§Ä±kan nesneden Ã§Ä±karÄ±lÄ±r.

### 4.2.2 DataFrame

DataFrame dikdÃ¶rtgen bir veri tablosunu temsil eder ve her biri farklÄ± bir deÄŸer tÃ¼rÃ¼ **(numeric, string, boolean, vb.)** olabilen sÄ±ralÄ± bir sÃ¼tun koleksiyonu iÃ§erir.

Bir veri Ã§erÃ§evesi oluÅŸturmak iÃ§in **pd.DataFrame()** fonksiyonunu Ã§aÄŸÄ±rmalÄ±sÄ±nÄ±z

- **DataFrame**, iki boyutlu etiketli bir veri yapÄ±sÄ±dÄ±r (satÄ±rlar ve sÃ¼tunlar).

- **Excel** tablolarÄ± veya **SQL** tablolarÄ± gibi dÃ¼ÅŸÃ¼nÃ¼lebilir.

- **head():** ilk 5 (varsayÄ±lan) satÄ±rÄ± getirir

- **tail():** son 5 (varsayÄ±lan) satÄ±rÄ± getirir

In [ ]:
df=pd.DataFrame([[1,2,3],[4,5,6]])
print(df)
#    0  1  2
# 0  1  2  3
# 1  4  5  6

Ä°ndeksleri ve sÃ¼tunlarÄ± aÃ§Ä±kÃ§a belirlemediÄŸimiz iÃ§in 0'dan N'ye kadar sayÄ±lar atadÄ±

Bir **DataFrame** oluÅŸturmanÄ±n birÃ§ok yolu vardÄ±r, ancak en yaygÄ±n olanlarÄ±ndan biri eÅŸit uzunlukta **listelerden** veya **NumPy** dizilerinden oluÅŸan bir **sÃ¶zlÃ¼k** yapÄ±sÄ±dÄ±r.

In [ ]:
# SÃ¶zlÃ¼k yapÄ±sÄ±ndan DataFrame oluÅŸturma
data = {
    'Name': ['Alice', 'Bob', 'Charlie',"Ali"],
    'Age': [25, 30, 35, 22],
    'City': ['New York', 'London', 'Paris',"New York"]
}
df = pd.DataFrame(data)
print(df)
#       Name  Age      City
# 0    Alice   25  New York
# 1      Bob   30    London
# 2  Charlie   35     Paris

## 4.3 Veri Okuma ve Yazma

### 4.3.1 CSV DosyasÄ± Okuma

In [ ]:
# CSV dosyasÄ± okuma
df = pd.read_csv('data.csv')

# Ä°lk 5 satÄ±rÄ± gÃ¶rÃ¼ntÃ¼leme
print(df.head())

### 4.3.2 Excel DosyasÄ± Okuma

In [ ]:
# Excel dosyasÄ± okuma
df = pd.read_excel('data.xlsx')

### 4.3.3 Veriyi Dosyaya Yazma

In [ ]:
# CSV dosyasÄ±na yazma
df.to_csv('output.csv', index=False)

# Excel dosyasÄ±na yazma
df.to_excel('output.xlsx', index=False)

## 4.4 DataFrame Ä°ÅŸlemleri

### 4.4.1 Veriye EriÅŸim

DataFrame'deki bir sÃ¼tun, **sÃ¶zlÃ¼k** benzeri gÃ¶sterimle veya Ã¶zniteliÄŸe gÃ¶re **Seri** olarak alÄ±nabilir:

- SÃ¼tun SeÃ§me 

- SatÄ±r SeÃ§me --> **pd.DataFrame.iloc**

- Belirli Bir HÃ¼creye EriÅŸim --> **pd.DataFrame.loc**

In [4]:
print(df['Name'])  # Name sÃ¼tununu seÃ§er
print("-"*20)
print(df.iloc[0])  # Ä°lk satÄ±rÄ± seÃ§er
print("-"*20)
print(df.loc[0, 'Name'])  # Ä°lk satÄ±rÄ±n Name sÃ¼tunundaki deÄŸer

0      Alice
1        Bob
2    Charlie
3        Ali
Name: Name, dtype: object
--------------------
Name       Alice
Age           25
City    New York
Name: 0, dtype: object
--------------------
Alice

In [5]:
# Display komutu dataframe'i daha gÃ¼zel gÃ¶sterir
display(df.head(2))  # Ä°lk 2 satÄ±rÄ± seÃ§er 
display(df.tail(3))  # Son 3 satÄ±rÄ± seÃ§er

    Name  Age      City
0  Alice   25  New York
1    Bob   30    London

      Name  Age      City
1      Bob   30    London
2  Charlie   35     Paris
3      Ali   22  New York

## 4.5 Veri Filtreleme

### 4.5.1 KoÅŸullu Filtreleme

In [6]:
filtered_df = df[df['Age'] > 30]  # YaÅŸÄ± 30'dan bÃ¼yÃ¼k olanlar
display(filtered_df)

      Name  Age   City
2  Charlie   35  Paris

### 4.5.2 Ã‡oklu KoÅŸullar

In [7]:
filtered_df = df[(df['Age'] > 25) & (df['City'] == 'London')]
display(filtered_df)

  Name  Age    City
1  Bob   30  London

## 4.6 Veri Ekleme ve Silme

### 4.6.1 Yeni SÃ¼tun Ekleme

Bir sÃ¼tuna **liste** veya **dizi** atarken, deÄŸerin uzunluÄŸu **DataFrame'in uzunluÄŸuyla** eÅŸleÅŸmelidir

In [8]:
df['Salary'] = [50000, 60000, 70000, 30000]
display(df)

      Name  Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Paris   70000
3      Ali   22  New York   30000

### 4.6.2 SatÄ±r Silme

**drop():** Veri setinden sÃ¼tunlarÄ± veya satÄ±rlarÄ± silmenizi saÄŸlar.

In [9]:
df_ = df.drop(0,axis=0)  # Ä°lk satÄ±rÄ± siler
display(df_)

      Name  Age      City  Salary
1      Bob   30    London   60000
2  Charlie   35     Paris   70000
3      Ali   22  New York   30000

### 4.6.3 SÃ¼tun Silme

In [10]:
df_drop = df.drop('City', axis=1)  # City sÃ¼tununu siler
display(df_drop)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3      Ali   22   30000

## 4.7 Veri Gruplama

**groupby():** Veri setini bir veya birden fazla deÄŸiÅŸkene gÃ¶re gruplamayÄ± saÄŸlar.

**agg():** Veri setinde aritmetik iÅŸlemler yapmayÄ± saÄŸlar.

In [11]:
grouped = df.groupby('City')['Age'].mean()  # Åžehre gÃ¶re yaÅŸ ortalamasÄ±
print(grouped)

City
London      30.0
New York    23.5
Paris       35.0
Name: Age, dtype: float64

In [12]:
summary = df.groupby("City").agg({
    'Age': ['min', 'max', 'mean'],
    'Salary': 'sum'
})
display(summary)

         Age           Salary
         min max  mean    sum
City
London    30  30  30.0  60000
New York  22  25  23.5  80000
Paris     35  35  35.0  70000

## 4.8 Eksik Veri Ä°ÅŸlemleri

**isnull():** Eksik verileri True olarak gÃ¶sterir.

**fillna()** Eksik verileri doldurmayÄ± saÄŸlar.

**dropna()** Eksik verileri iÃ§eren satÄ±rlarÄ± siler.

In [17]:
import numpy as np

# Eksik veriler iÃ§eren bir DataFrame oluÅŸturur.
data = {
    "Ä°sim": ["Ali", "AyÅŸe", "Mehmet", "Zeynep"],
    "YaÅŸ": [25, np.nan, 30, 22],
    "MaaÅŸ": [5000, 7000, np.nan, 4500],
    "Åžehir": ["Ä°stanbul", "Ankara", "Ä°zmir", "Rize"]
}

df = pd.DataFrame(data)
display(df)

     Ä°sim   YaÅŸ    MaaÅŸ     Åžehir
0     Ali  25.0  5000.0  Ä°stanbul
1    AyÅŸe   NaN  7000.0    Ankara
2  Mehmet  30.0     NaN     Ä°zmir
3  Zeynep  22.0  4500.0      Rize

In [18]:
display(df.isnull())  # Eksik verileri True olarak gÃ¶sterir

    Ä°sim    YaÅŸ   MaaÅŸ  Åžehir
0  False  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False  False

In [19]:
df_filled = df.fillna(0)  # Eksik verileri 0 ile doldurur
display(df_filled)

     Ä°sim   YaÅŸ    MaaÅŸ     Åžehir
0     Ali  25.0  5000.0  Ä°stanbul
1    AyÅŸe   0.0  7000.0    Ankara
2  Mehmet  30.0     0.0     Ä°zmir
3  Zeynep  22.0  4500.0      Rize

In [20]:
df_cleaned = df.dropna()  # Eksik verileri iÃ§eren satÄ±rlarÄ± siler
display(df_cleaned)

     Ä°sim   YaÅŸ    MaaÅŸ     Åžehir
0     Ali  25.0  5000.0  Ä°stanbul
3  Zeynep  22.0  4500.0      Rize

## 4.9 Reindexing

Pandas nesneleri Ã¼zerindeki Ã¶nemli bir yÃ¶ntem, yeni bir dizine uygun verilerle yeni bir nesne oluÅŸturmak anlamÄ±na gelen **reindex**'tir.

In [ ]:
obj = pd.Series([1.5, 7.8, -5.8, 3.0], index=['e', 'f', 'd', 'c'])
print(obj)
# e    1.5
# f    7.8
# d   -5.8
# c    3.0
# dtype: float64

In [ ]:
obj2 = obj.reindex(['f', 'b', 'c', 'd', 'e'])
print(obj2)
# f    7.8
# b    NaN
# c    3.0
# d   -5.8
# e    1.5
# dtype: float64

**DataFrame** ile **reindex**, (satÄ±r) indeksini, sÃ¼tunlarÄ± veya her ikisini birden deÄŸiÅŸtirebilir. YalnÄ±zca bir dizi seÃ§ildiÄŸinde, sonuÃ§taki satÄ±rlarÄ± yeniden indeksler:

In [ ]:
import numpy as np

dataframe = pd.DataFrame(np.arange(9).reshape((3, 3)),
                             index=['a', 'c', 'd'],
                            columns=['Istanbul', 'Ankara', 'Giresun'])
print(dataframe)
#    Istanbul  Ankara  Giresun
# a         0       1        2
# c         3       4        5
# d         6       7        8

In [ ]:
r_data = dataframe.reindex(['a', 'b', 'c', 'd'])
print(r_data)
#    Istanbul  Ankara  Giresun
# a       0.0     1.0      2.0
# b       NaN     NaN      NaN
# c       3.0     4.0      5.0
# d       6.0     7.0      8.0

SÃ¼tunlar, **columns** anahtar sÃ¶zcÃ¼ÄŸÃ¼ ile **yeniden indekslenebilir (reindex)**:

In [ ]:
c_data = dataframe.reindex(columns=['Istanbul', 'Ankara', 'Izmir'])
print(c_data)
#    Istanbul  Ankara  Izmir
# a         0       1    NaN
# c         3       4    NaN
# d         6       7    NaN

## 4.10 Pivot Tables

**Pivot tablo**, elektronik tablo programlarÄ±nda ve diÄŸer veri analizi yazÄ±lÄ±mlarÄ±nda sÄ±klÄ±kla bulunan bir **veri Ã¶zetleme** aracÄ±dÄ±r.

Bir veri tablosunu bir veya daha fazla anahtara gÃ¶re toplar ve verileri, grup anahtarlarÄ±nÄ±n bazÄ±larÄ± **satÄ±rlar boyunca** ve bazÄ±larÄ± **sÃ¼tunlar boyunca** olacak ÅŸekilde bir dikdÃ¶rtgen iÃ§inde dÃ¼zenler. 

Python'da pandas ile pivot tablolar, **hiyerarÅŸik indeksleme** kullanan yeniden ÅŸekillendirme iÅŸlemleriyle birlikte bu bÃ¶lÃ¼mde aÃ§Ä±klanan groupby olanaÄŸÄ± sayesinde mÃ¼mkÃ¼n olmaktadÄ±r.

In [24]:
# Ã–rnek bir DataFrame oluÅŸturuyoruz
data = {
    'BÃ¶lge': ['Ä°stanbul', 'Ä°stanbul', 'Ankara', 'Ankara', 'Ä°zmir', 'Ä°zmir'],
    'Kategori': ['Elektronik', 'Mobilya', 'Elektronik', 'Mobilya', 'Elektronik', 'Mobilya'],
    'SatÄ±ÅŸ': [1500, 2000, 1200, 1800, 1600, 1700],
    'Maliyet': [800, 1200, 600, 1100, 700, 1000]
}

df = pd.DataFrame(data)

display(df)

      BÃ¶lge    Kategori  SatÄ±ÅŸ  Maliyet
0  Ä°stanbul  Elektronik   1500      800
1  Ä°stanbul     Mobilya   2000     1200
2    Ankara  Elektronik   1200      600
3    Ankara     Mobilya   1800     1100
4     Ä°zmir  Elektronik   1600      700
5     Ä°zmir     Mobilya   1700     1000

In [25]:
# Pivot table oluÅŸturma
pivot_table = pd.pivot_table(df, values=['SatÄ±ÅŸ', 'Maliyet'], 
                             index='BÃ¶lge', 
                             columns='Kategori', 
                             aggfunc={'SatÄ±ÅŸ': 'sum', 'Maliyet': 'sum'})
display(pivot_table)

            Maliyet              SatÄ±ÅŸ
Kategori Elektronik Mobilya Elektronik Mobilya
BÃ¶lge
Ankara          600    1100       1200    1800
Ä°stanbul        800    1200       1500    2000
Ä°zmir           700    1000       1600    1700

## 4.11 Veri KÃ¼melerini BirleÅŸtirme - Merge

**pd.merge()**, DataFrame'lerdeki satÄ±rlarÄ± bir veya daha fazla anahtara gÃ¶re birbirine baÄŸlar. 

Bu, veritabanÄ± birleÅŸtirme iÅŸlemlerini uyguladÄ±ÄŸÄ± iÃ§in SQL veya diÄŸer iliÅŸkisel veritabanlarÄ± kullanÄ±cÄ±larÄ±na tanÄ±dÄ±k gelecektir.

### 4.11.1 Many-to-One BirleÅŸtirme

In [26]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                        'data1': range(7)})

df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                   'data2': range(3)})
display(df1)
display(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

  key  data2
0   a      0
1   b      1
2   d      2

In [27]:
pd.merge(df1,df2)
# Bu, many-to-one birleÅŸtirme Ã¶rneÄŸidir; df1'deki verilerde a ve b etiketli birden fazla satÄ±r varken
# df2'de key sÃ¼tununda her deÄŸer iÃ§in yalnÄ±zca bir satÄ±r vardÄ±r.

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

Hangi sÃ¼tunda birleÅŸtirileceÄŸini belirtmediÄŸimize dikkat edin. 

Bu bilgi belirtilmezse, birleÅŸtirme anahtar olarak Ã§akÄ±ÅŸan sÃ¼tun adlarÄ±nÄ± kullanÄ±r

**'on'** parametresi ile birleÅŸtirme iÃ§in kullanÄ±lacak sÃ¼tunu seÃ§ebiliriz

In [28]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [29]:
df3 = pd.DataFrame({'left_idx': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
display(df3)

  left_idx  data1
0        b      0
1        b      1
2        a      2
3        c      3
4        a      4
5        a      5
6        b      6

In [30]:
df4 = pd.DataFrame({'right_idx': ['a', 'b', 'd'],
                   'data2': range(3)})
display(df4)

  right_idx  data2
0         a      0
1         b      1
2         d      2

In [31]:
pd.merge(df3, df4, left_on='left_idx', right_on='right_idx')

  left_idx  data1 right_idx  data2
0        b      0         b      1
1        b      1         b      1
2        a      2         a      0
3        a      4         a      0
4        a      5         a      0
5        b      6         b      1

'c' ve 'd' deÄŸerlerinin ve iliÅŸkili verilerin sonuÃ§ta eksik olduÄŸuna dikkat edin.

VarsayÄ±lan olarak birleÅŸtirme bir **'inner join'** yapar; sonuÃ§taki anahtarlar kesiÅŸimdir veya her iki tabloda bulunan ortak kÃ¼medir.

DiÄŸer olasÄ± seÃ§enekler **'left'**, **'right'** ve **'outer'** seÃ§enekleridir

In [32]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   a    2.0    0.0
1   a    4.0    0.0
2   a    5.0    0.0
3   b    0.0    1.0
4   b    1.0    1.0
5   b    6.0    1.0
6   c    3.0    NaN
7   d    NaN    2.0

### 4.11.2 Many-to-many BirleÅŸtirme

Many-to-many birleÅŸtirmeler, satÄ±rlarÄ±n Kartezyen Ã§arpÄ±mÄ±nÄ± oluÅŸturur.

In [35]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
display(df1)
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})
display(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [36]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

Soldaki DataFrame'de Ã¼Ã§ ve saÄŸdakinde iki 'b' satÄ±rÄ± olduÄŸundan, sonuÃ§ta altÄ± 'b' satÄ±rÄ± vardÄ±r.

**inner join** AnahtarlarÄ±n kesiÅŸimini alÄ±r

In [37]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

### 4.11.3 Birden fazla anahtarla birleÅŸtirmek

In [38]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],                 
                     'lval': [1, 2, 3]})
display(left)

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [39]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                    'key2': ['one', 'one', 'one', 'two'],
                    'rval': [4, 5, 6, 7]})
display(right)

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [40]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  bar  one   3.0   6.0
1  bar  two   NaN   7.0
2  foo  one   1.0   4.0
3  foo  one   1.0   5.0
4  foo  two   2.0   NaN

In [41]:
pd.merge(left, right, on=['key1', 'key2'], how='inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

### 4.11.4 Ã‡akÄ±ÅŸan sÃ¼tun adlarÄ±nÄ± birleÅŸtirme

In [42]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

varsayÄ±lan son eki (suffix) istemiyorsanÄ±z, istediÄŸiniz bir son eki (suffix) seÃ§ebilirsiniz.

In [43]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

## 4. AlÄ±ÅŸtÄ±rmalar
1. Bir CSV dosyasÄ± yÃ¼kleyin ve ilk 10 satÄ±rÄ±nÄ± gÃ¶rÃ¼ntÃ¼leyin.

2. YaÅŸÄ± 30'dan bÃ¼yÃ¼k olan kiÅŸileri filtreleyin.

3. Yeni bir sÃ¼tun ekleyerek her kiÅŸinin yaÅŸÄ±nÄ± 5 yÄ±l artÄ±rÄ±n.

4. Åžehirlere gÃ¶re ortalama yaÅŸÄ± hesaplayÄ±n.

5. Eksik verileri iÃ§eren satÄ±rlarÄ± silin.

Daha fazla bilgi iÃ§in [Pandas dokÃ¼mantasyonuna](https://pandas.pydata.org/docs/reference/index.html)
gÃ¶z atabilirsiniz.